import UIKit

// 1.Создать класс "люди", в этом классе 4 property - "имя", "рост", "вес", "пол", а также будет иметь метод "say(говорит)".



// 2.Создать sub class (наследники) "повар", "менеджер", "борец" и переопределить метод "say(говорит)" в каждом из этих классов.



// 3.Создать по одному объекту(экземпляру) каждого класса и объединить их в массив.



// 4.В цикле “for in” пройти по всем элементам массива и вывести в консоль все характеристики каждого объекта (имя, рост и тд) и у каждого вызвать метод "say(говорит)".



// 5.Создать еще одного наследника от super Class, добавить в него пару новых свойств, добавить в массив и в цикле вывода вывести его свойства как дополнение к свойствам People.



// 6.Метод "say(говорит)" реализовать таким образом, чтобы перед тем как выполнить собственный method say, выполнялся сначала метод say класса People.



// 7.Вывести все это в обратном порядке(Google в помощь).



// 8.Создать класс "Марсианин" (не наследник класса people!) со своими собственными property (отличными от people) и методом "say" (отличным от people).



// 9.Унаследоваться от него и создать пару других классов (Инопланетян) с переопределенным методом "say".



// 10.Объединить всех people и Марсианинов) в один массив.



// 11.В цикле выводить тип объекта (People или Марсианин) перед тем как выводить его свойства и вызывать метод


