import UIKit

//Создать 10 разных Dictionary с разными типами данных.Один из них должен содержать все месяца года на русском.Второй на английском



//Соберите все ключи и значения каждого Dictionary и распечатайте в консоль



//Создайте пустой Dictionary и через условный оператор if проверьте пустой он или нет если пустой то в условии добавьте в него пару значений􏰀



//Cоздайте словарь — ключ: «иномарка», «значение»: название машины.



//Добавьте в него значение по ключу - «отечественная». Распечатайте ключи и значения в консоль. Затем отдельно только значения.



//Удалите из словаря иномарку по ключу (двумя способами: через nil и removeValue().



//Создайте словарь, где ключ — фамилия солдата, а значение — его приветствие.



//В цикле пройдитесь по всем ключам и распечатайте фамилию каждого солдата.



//Сделайте тоже самое со значениями и распечатайте приветствие каждого солдата.


