import UIKit

// 1) Создать класс "IOSStudents", добавить ему property: dateOfBirth, skills. Для тренировки.



// 2) Создавайте свои структуры с разными видами свойств: сохраняемые/не сохраняемые, вычисляемые, свойства типа и т.д.



// 3) Написать структуру "CreateTriangle",с двумя свойствами - угол A,угол C.
// Создать 2 вычисляемых свойства - те же угол А,угол С.
// Если мы записываем значения в эти углы - результатом должно быть значение третьего угла.
// Для простоты можно взять прямоугольный треугольник, сумма углов которого равна 180 градусов.



// 4) Создать структуру "Резюме", у которой есть такие свойства:
// Фамилия
// Имя
// Должность
// Опыт
// Контактные данные(телефон, емейл)
// О себе(можно записать какие-то пару предложений на выбор).



// 5) Задание на закрепление предыдущих тем:
// Создать журнал, чтоб можно было писать имя, фамилию и оценку
// Поставить ограничения: имя и фамилия не выше 15 символов каждое и оценка не выше 5
// Если везде значения превышают выдавать об этом Сообщения в консоль



// 6) Написать класс, в котором есть 4 функции:
// пустая, которая просто выводит сообщение через print
// которая принимает параметры и выводит их в консоль
// которая принимает и возвращает параметры
// которая принимает замыкание и распечатывает результаты в консоль


