import UIKit

//1) Создать цикл в цикле. В первом цикле интервал 200 раз во втором как доедем до 15 выйти со всех циклов:)



//2)Создать в if и отдельно в switch программу которая будет смотреть на возраст человека и говорить куда ему идти в школу, в садик, в универ, на работу или на пенсию и тд



//3)Создать все циклы for in которые вы знаете ,максимально больше приветствуеться



//4)в switch и отдельно в if создать систему оценивания школьников по 12 бальной системе и и высказывать через print мнение



//5) Создайте массив(без тюплов) с именами всех членов вашей семьи включая родственников что б количество имен не менее 10 было и отсортируйте, распечатайте по алфавиту их в консоль


