import UIKit

// 1.Создать класс в котором будет 3 проперти мама Папа и дети . Создать subscript и упорядочить их по индексу.



// 2.Создать Индекс который будет принимать число умножать его на 100 и делить на 2.



// 3.Создать свой subscript у которого внутри есть оператор if else.



// 4.Создать класс человек и в нем 3 проперти имя , возраст пол.



// 5.Создать ещё 2 класса которые наследуються от класса человек и переопределить методы и свойства.



// 6.Создать дикшинари который хранит все типы данных которые есть а ключ должен быть только строка (воспользоваться enum для типов данных)


