import UIKit

//1) Создать 3 функции:
// первая функция принимает массив Int и сортирует его по порядку (возрастание). После
//этого распечатывает результат в консоль;
// вторая функция принимает массив String, меняет 1, 2 и 3 элементы и сортирует по
//алфавиту. После этого распечатывает результат в консоль;
// третья функция принимает 2 массива String и складывает их. После этого
//распечатывает результат в консоль.



//2) Создать журнал для учителя, который будет принимать имя студента, профессию и оценку и записывает это все в массив. И внесите 10 студентов туда и распечатаете через цикл for.



//3) Создать функцию которая принимает имя и фамилию, потом положить это в массив и вывести результат в консоль.



//4) Создайте функцию которая принимает параметры и вычисляет площадь круга.



//5) Создайте Dictionary с именем ученики , где ключ name и score, а значение (1 тюпл из 5 имен) и (второй тюпл из 5 оценок).И распечатайте только имена по ключу.



//6) Функция принимает 3 массива String. Задача: сложить их вместе, преобразовать в тип Int и посчитать сумму. Распечатать результат в консоль.



