import UIKit

//1) Написать программу, в которой создать класс "House" в нем несколько свойств - "width", "height" и несколько методов - "create"(выводит произведение свойств),"destroy"(отображает что дом уничтожен)и т.п.



//2) Создайте класс с методами, которые сортируют массив учеников.



//3) Написать свою структуру и пояснить в комментариях - чем отличаются структуры от классов.



//4) Дополнительно(на закрепление всех пройденных тем): Напишите простую программу, которая называет комбинации в покере.
// Записываем комбинации в массив.
// Если определённая комбинация - выводим соответствующую запись в print.
//Результат в консоли примерно такой: "У вас бубновый стрит флеш".
//Подсказки:
//- для мастей можно использовать перечисления(enum)
//- В зависимости от комбинации - в консоли печатаем тот или иной ответ.
//- Комбинации можно взять отсюда: http://www.russiapokernews.com/poker-hand-ranking



//5) Написать класс , а в нем метод который будет принимать букву (одну, может быть и типа string, просто будете передавать ему одну букву) и возвращать все имена которые начинаются на эту букву.
//К примеру, А - Алексей, Александр, Артем, Антон и т. д. Внутри метода или полем класса (тут как удобно, не сильно критично) будет задаваться массив строк (string) в котором будут прописаны имена. Имена откуда-то подгружать не надо, их надо просто захардкодить. Метод должен возвращать отфильтрованный массив с именами.
//Так же написать метод, который будет принимать массив строк как аргумент и выводить их всех на консоль с новой строки каждое имя. Имя распечатаете на консоль то что у вас получилось отфильтровать.




