import UIKit

//3) Создать 5 разных Tuples с разными типами данных.Один из них должен содержать все месяца года на русском.Второй на английском



//4) Распечатайте Tuples 3 мя разными способами



//5) Создайте пустой Tuples (Можно гуглить)



//1) Создать кортеж с 3-5 значениями. Вывести их в консоль 3 способами.



/* 2) Давайте представим, что мы сотрудник ГАИ и у нас есть какое-то количество нарушителей. Задача. Создать кортеж с тремя параметрами:
 первый - превышение скорости: количество пойманных;
 второй - вождение нетрезвым: количество пойманных;
 третий - бесправники: количество пойманных.*/



//Распечатайте наших бедокуров в консоль через print().



//3) Выведите каждый параметр в консоль. Тремя способами.



//4) Создайте второй кортеж — нашего напарника. Значения задайте другие.



//5) Пусть напарники соревнуются: создайте третий кортеж, который содержит в себе разницу между первым и вторым.



//Вывести в консоль тремя способами.



